#include <stdio.h>
#include <stdlib.h> /* библиотека функции, занимающиеся выделением памяти, контроль процесса выполнения программы, преобразования типов и другие(для strtol)   */



int main()
{
	setlocale(0, "russian");
	char a[32];
	printf("Введите число в двоичном виде: ");/* стандартный ввод (stdin) */
	fgets(a, 32, stdin);/*Функция fgets считывает символы из потока и сохраняет их в виде строки в параметр (32) до тех пор пока не наступит конец строки или пока не будет достигнут конец файла */
	char * z;
	long int b;
	b = strtol(a, &z, 2);/*strtol преобразование типов строка в длинное целое число (long integer)*/
    printf("Ваше число в десятичной форме записи: %d\n", b);
	return 0;
}
